# 1) დაასრულეთ პროექტები

# 2) შექმენი custom hook სახელად useCounter, რომელიც მართავს რაოდენობის მომატებას და განულებას.

# ეს hook უნდა აკეთებდეს შემდეგს:

# გამოიყენოს useState

# დაიწყოს 0-დან

# დააბრუნოს:

# მიმდინარე რიცხვი

# ფუნქცია, რომელიც ზრდის რიცხვს ერთით

# ფუნქცია, რომელიც აბრუნებს რიცხვს 0-ზე

# გამოიყენე ეს hook ღილაკებით: ერთი ღილაკი ზრდის რიცხვს, მეორე ღილაკი აბრუნებს 0-ზე. აჩვენე რიცხვი გვერდზე


# 3) შექმენი custom hook სახელად useInput, რომელიც დაგეხმარება input-ის მნიშვნელობის მართვაში.

# ეს hook უნდა აკეთებდეს შემდეგს:

# გამოიყენოს useState

# დააბრუნოს:

# მნიშვნელობა (value)

# ფუნქცია, რომელიც შეცვლის მნიშვნელობას input-ის ცვლილებაზე

# გამოიყენე ეს hook ორი input-ისთვის (მაგ. სახელი და იმეილი) და აჩვენე ორივე მნიშვნელობა გვერდზე


# i did in codesandbox