# 1) შექმენით ცვლადი, სადაც შეინახავთ string-ს. დაბეჭდეთ მისი თითოეული სიმბოლო და გვერდით მიუწერეთ რიგით მერამდენეა ის.

# მგალითად: "Hello" >>> "H - 1", "e - 2"...

string = input("Please enter your string: ")
index= 0
for i in string:
    print(i + " - " + str(index))
    index += 1

# 2) შექმენით manual_join ფუნქცია, რომელსაც გადაეცემა სთინგების სია და ერთი სთრინგი. ამ ფუნქციამ უნდა შეართოს ეს სია და თითოეულ ელემენტს შორის ჩასვას გადმოცემული სთრინგი

# არ გამოიყენოთ .join() ფუნქცია
# def manual_join(name):
#     result = ""
#     for i in range(len(name)):
#         result += name[i]
#         if i < len(name) - 1:
#             result += " "
#     return result
# print(manual_join(["Hi", "my name is nuki" "What is your name?"]))

# 3) შექმენით manual_count ფუნქცია, რომელსაც გადაეცემა სთრინგი და სია და ელემენტი რომლის რაოდენობაც უნდა გაიგოთ. დააბრუნეთ მიღებული შედეგი.


# 4) შექმენით manual_replace ფუნქცია, რომელიც იქნება .replace() ფუნქციის კლონი. ამ ფუნქციამ სთრინგში არსებული sapce-ები უნდა შეცვალოს ტირეებად.

# არ გამოიყენოთ ჩაშენებული ფუნქციები და კომენტარებით ახსენით მე-4 დავალება

# 5) შექმენით manual_range ფუნქცია, რომელიც იქნება range ფუნქციის კოლნი, ამ ფუნქციას უნდა ჰქონდეს 3 არგუმენტი, მაგრამ თუ გამოძახებისას გადაეცა მხოლოდ 1 არგუმენტი default-ად start-ის მნიშვნელობა იქნება 0 და step-ის 1. ხოლო 2 არგუმენტის შემთხვევაში მხოლოდ step-ი იქნება 1.

# გაიხსენეთ, რომ range ფუნქციას გადაეცემა 3 პარამეტრი start, end, step
