# 1

# perents

print("მარი")
print("თინა")
print("თემო")
print("თაზო")
print("დიმა")
print("ივა")
print("ნუკი")

# frends

print("გიორგი ვარადაშვილი")
print("ბარბარე ლომიძე")
print("ბარბარე ბარბარე")
print("ნია კახაშვილი")
print("ქეთი დარჩიაშვილი")
print("მარიამ კაპანაძე")
print("ანამარია ჭერაშვილი")
print("ანი სეფაშვილი")

# 2
print(259303 + 94949)
print(98903487 * 473)
print(9437697394 - 94893)
print(8048604380 / 89)
print(47172985 + 739289391)
print(3877592 - 4893284)
print(9698792 + 42894891)
print(78692864 / 8392)
print(79759237 + 37482)
print(87927892 - 387393)
print(869675 / 5838)
print(90603480 * 4647912)
print(973975350 + 357928952)
print(95205 + 385892895)
print(94832850238 * 7432932)
print(41241412 - 753292)
print(1442124 + 213799)
print(5325325 - 73739)
print(532532 * 7273719)
print(32532532 + 8486784)
print(5325252 / 5784)
print(525325 + 827482)
print(2552 * 3892)
print(532552 / 3279329)

