# 1
print("მამა")
print("ბებო")
print("ძმები")
print("დედა")

# მეგობრების სახელები
print("ბარბარე")
print("ქეთი")
print("მარიამი")


# 2
# მათემატიკური ოპერაციები

# დამატება
print(5 + 5)  # 10

# კლება
print(10 - 5)  # 5

# გამრავლება
print(5 * 5)  # 25

# გაყოფა
print(10 / 2)  # 5.0

# მთვლელობის ძირი
print(25 ** 0.5)  # 5.0

# დანაყოფი
print(10 // 3)  # 3

# გადარჩენა余
print(10 % 3)  # 1

# ზედა ლოგიკური ოპერაცია
print(5 + 3 * 2)  # 11

# ნაკლები ქვეითი
print(100 - 50 * 2)  # 0

# კლება + დაყოფა
print((10 - 5) / 5)  # 1.0
