# type() არის ფუნქცია, რომელიც აბრუნებს გადაცემული არგუმენტის მონაცემთა ტიპს

# მაგალითად:
# type(10) >>> integer
# type("15") >>> string
# type(2.5) >>> float
# type(True) >>> boolean

# დაიმახსოვრეთ, type ფუნქცია აბრუნებს შედეგს და არ გამოაქვს პასუხი ტერმინალში. ამისათვის საჭიროა გადავცეთ ის print() ფუნქციას არგუმენტად:

# print(type(10))

# გაყოფის ტიპები:
# / - დაგვიბრუნებს ზუსტ პასუხს.

# // - მაგალითად: 13 // 2 დაგვიბრუნებს პასუხად 6-ს. ანუ რამდენჯერ შედის ორი ცამეტში.

# % - დაგვიბრუნებს ნაშთს.
# მაგალითად: 
# 10 % 2 = 0;
# 11 % 2 = 1

# print(type(10.3))
# print(5 <= 10)

# result = 5 < 2 or 5 > 3

# print(result)