// 1
// Middleware — არის ფუნქცია, რომელიც ეშვება request და response
// ობიექტებს შორის Express-ში. მას შეუძლია:
// - მოთხოვნის დამუშავება,
// - მოდიფიკაცია,
// - რეაგირება და
// - შემდეგ middleware-ს ან როუტერის გამოძახება (next()).

// morgan — არის პოპულარული middleware,
// რომელიც ლოგავს (ბეჭდავს) თითოეული HTTP მოთხოვნის ინფორმაციას
// (როგორიცაა მეთოდი, URL, სტატუსი, და სხვა).
// ახლა დავწეროთ მისი პატარა კლონი, რომელიც მხოლოდ მეთოდს და URL-ს დაბეჭდავს.

function simpleMorgan(req, res, next) {
  console.log(`${req.method} ${req.url}`);
  next(); 
}
 

// 2
/*
.env — არის კონფიგურაციის ფაილი, სადაც შენ შეგიძლია შეინახო საიდუმლო
მონაცემები და პარამეტრები (მაგ: PORT, DB_URL, NODE_ENV და სხვა).
ეს ფაილი არ უნდა მოხვდეს ვერსიაზე კონტროლში (git), რადგან
შეიძლება შეიცავდეს მგრძნობიარე ინფორმაციას.

express-მა შეუძლია წაიკითხოს გარემოს ცვლადები,
რომლებსაც ჩვენ ვაყენებთ .env ფაილში.

მაგალითად:
NODE_ENV=development
PORT=3000

ამის წასაკითხად და გამოყენებისთვის არსებობს სპეციალური მოდული
dotenv, რომელიც ასახავს .env-ში მითითებულ ცვლადებს
process.env ობიექტში.

ამიტომ უნდა დააინსტალიროთ:
npm install dotenv
*/
